/**
 * @file	Billboard2D.cpp
 * @brief	2Dビルボード描画クラス実装
 * @author	morimoto
 */

//----------------------------------------------------------------------
// Include
//----------------------------------------------------------------------
#include "Billboard2D.h"


namespace Lib
{
	//----------------------------------------------------------------------
	// Constructor	Destructor
	//----------------------------------------------------------------------
	Billboard2D::Billboard2D()
	{
	}

	Billboard2D::~Billboard2D()
	{
	}
}
