/**
 * @file	IAnimation.cpp
 * @brief	アニメーションインターフェース実装
 * @author	morimoto
 */

//----------------------------------------------------------------------
// Include
//----------------------------------------------------------------------
#include "IAnimation.h"


namespace Lib
{
	//----------------------------------------------------------------------
	// Constructor	Destructor
	//----------------------------------------------------------------------
	IAnimation::IAnimation()
	{
	}

	IAnimation::~IAnimation()
	{
	}
}

